Repository: explorerhq/sql-explorer
Catalog: explorer/locale/*/LC_MESSAGES/django.po
Languages: pt_br, ru

source: Include in snapshot task (if enabled)
pt_br: Incluir na tarefa de estado (se habilitado)
ru: Включить в задачу снятия снепшота (если разрешено)

source: Name of DB connection (as specified in settings) to use for this query.Will use EXPLORER_DEFAULT_CONNECTION if left blank
pt_br: Nome da conexão do BD(definida nas configurações) para usar nessa consulta. Será usada EXPLORER_DEFAULT_CONNECTION se deixada em branco
ru: Название соединения БД (как указано в настройках), чтобы использовать для этого запроса.Если не использовать, будет использоваться соединение по умолчанию

source: Will be included as a good example of SQL in assistant queries that use relevant tables
pt_br: Vai ser incluido como um bom exemplo de assistente consultas SQL que usam tabelas relevantes

source: Query
pt_br: Consulta
ru: Запрос

source: Queries
pt_br: Consultas
ru: Запросы

source: New Query
pt_br: Nova Consulta
ru: Новый запрос

source: Playground
pt_br: Explorar
ru: Полигон

source: Connections
pt_br: Conexões

source: Annotations
pt_br: Anotações

source: Logs
pt_br: Registros
ru: Журналы

source: Favorites
pt_br: Favoritos

source: Download...
pt_br: Baixar...

source: Empty Resultset
pt_br: Resultado Vazio
ru: Результат запроса пуст

source: The playground is for experimenting and writing ad-hoc queries. By default, nothing you do here will be saved.
pt_br: O 'explorar' é para experimentar e escrever consultas. Por padrão, nada que você fizer aqui será salvo.
ru: Полигон предназначен для экспериментов и написания специальных запросов. По умолчанию тут ничего не будет сохраняться

source: Connection
pt_br: Conexão
ru: Соединение

source: Refresh
pt_br: Recarregar
ru: Обновить

source: Save As New
pt_br: Salvar como Nova

source: Show Schema
pt_br: Exibir Estrutura
ru: Показать схему базы

source: Hide Schema
pt_br: Esconder Estrutura
ru: Скрыть схему

source: Playground Query
pt_br: Explorar Consulta
ru: Экспериментальный запрос

source: Preview
pt_br: Vizualizar
ru: Предпросмотр

source: Snapshots
pt_br: Estados
ru: Варианты

source: Pivot
pt_br: Pivô
ru: Сводная таблица

source: Line Chart
pt_br: Gráfico de Linha

source: Bar Chart
pt_br: Gráfico de Barra

source: Execution time: %(duration)s ms
pt_br: Tempo de execução: %(duration)s ms
ru: Время выполнения: %(duration)s мс

source: Showing
pt_br: Exibindo
ru: Отображение

source: First
pt_br: Primeiro
ru: Первый

source: of %(total_rows)s total rows.
pt_br: %(total_rows)s total de linhas.
ru: из %(total_rows)s выбранных записей.

source: Title
pt_br: Título
ru: Название

source: Description
pt_br: Descrição
ru: Описание

source: Assistant Example
pt_br: Exemplo de Assistente

source: Save & Run
pt_br: Salvar e Executar
ru: Сохранить и запустить

source: Save Only
pt_br: Apenas Salvar
ru: Сохранить

source: Avg. execution: %(avg_duration_display)sms. Query created by %(cuser)s on %(created)s.
pt_br: Tempo Médio de execução: %(avg_duration_display)sms. Consulta criada por %(cuser)s em %(created)s.

source: History
pt_br: Histórico
ru: История

source: Snapshot
pt_br: Estado
ru: Вариант

source: Are you sure you want to delete "%(title)s"?
pt_br: Você tem certeza que deseja apagar "%(title)s"?
ru: Вы уверены в удалении «%(title)s»?

source: Favorite Queries
pt_br: Consultas Favoritas

source: No favorite queries added yet.
pt_br: Nenhuma consulta favorita ainda.

source: Recently Run by You
pt_br: Executadas Recentemente por você
ru: Ваши последние запуски запросов, их %(qlen)s

source: Last Run
pt_br: Útima Execução
ru: Последний запуск

source: All Queries
pt_br: Todas as Consultas
ru: Все запросы

source: Search
pt_br: Procurar
ru: Поиск

source: Created
pt_br: Criada
ru: Создан

source: Play
pt_br: Executar
ru: Запустить

source: Delete
pt_br: Apagar
ru: Удалить

source: Favorite
pt_br: Favorito

source: Run Count
pt_br: Quantidade de Execuções
ru: Число запусков

source: by %(cuser)s
pt_br: por %(cuser)s
ru: пользователем «%(cuser)s»

source: Email will be sent when query completes
pt_br: E-mail será enviado quando a consulta terminar

source: Recent Query Logs - Page %(pagenum)s
pt_br: Registros de Consultas Recentes - Página %(pagenum)s
ru: Журнал последних запросов — страница %(pagenum)s

source: Run At
pt_br: Executado em
ru: Время запуска

source: Run By
pt_br: Executado por
ru: Запущено пользователем

source: Database Connection
pt_br: Conexão do Banco de Dados

source: Duration
pt_br: Duração
ru: Длительность

source: Query ID
pt_br: Identificador da Consulta
ru: ID запроса

source: Query %(query_id)s
pt_br: Consulta %(query_id)s
ru: пользователем «%(query_id)s»

source: Open
pt_br: Aberto
ru: Открыть

source: Page %(pnum)s of %(anum)s
pt_br: Página %(pnum)s de %(anum)s

source: Schema
pt_br: Estrutura
ru: Схема

source: Search Tables
pt_br: Tabela de Consultas

source: Collapse Tables
pt_br: Esconder Tabelas

source: Expand Tables
pt_br: Exibir Tabelas

source: Schema failed to build.
pt_br: Estrutura falhou em ser construída

source: The connection '%(connection)s' is likely misconfigured or unavailable.
pt_br: A conexão '%(connection)s' está mal configurada ou indisponível.

source: Query saved.
pt_br: Consulta Salva
ru: Запрос сохранен.

source: SQL Explorer
ru: SQL Навигатор

source: Playground SQL
ru: Экспериментальный SQL

source: Toggle Dropdown
ru: Включить выпадающий список

source: Save As New Query
ru: Сохранить как новый запрос

source: Download
ru: Скачать

source: Format
ru: Отформатировать запрос

source: Query Detail
ru: Подробности запроса

source: Avg. execution: %(avg_duration|floatformat:2)sms. Query created by %(user_email)s on %(created)s.
ru: Среднее время выполнения: %(avg_duration|floatformat:2)s мс. Запрос в %(created)s. от «%(user_email)s»

source: Email
ru: Емейл

source: Page %(pnum)s of %(anum)s.
ru: Страница %(pnum)s из %(anum)s.

source: Collapse All
ru: Свернуть все

source: Expand All
ru: Развернуть все

source: Schema is building...
ru: Строится схема…

source: Please wait a minute, and refresh.
ru: Подождите минутку и обновите.
